In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
 df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [5]:
df

          W         X         Y         Z
A  0.634612 -0.344411  0.231050  2.028470
B  0.862638 -0.848491  1.059671  0.919996
C  0.531450  0.528992 -1.554243  0.853573
D  1.576498 -0.361041 -0.887087 -0.784113
E  1.992746  1.144939  2.166459  0.734311

In [6]:
df['W']

A    0.634612
B    0.862638
C    0.531450
D    1.576498
E    1.992746
Name: W, dtype: float64

In [8]:
# get the data type of column w
type(df['W'])

pandas.core.series.Series

In [9]:
# call for multiple columns
df[['W', 'Z']]

          W         Z
A  0.634612  2.028470
B  0.862638  0.919996
C  0.531450  0.853573
D  1.576498 -0.784113
E  1.992746  0.734311

In [17]:
# create new column
df['newColumn'] = df['W'] + df['Y']
df

          W         X         Y         Z  newColumn
A  0.634612 -0.344411  0.231050  2.028470   0.865662
B  0.862638 -0.848491  1.059671  0.919996   1.922309
C  0.531450  0.528992 -1.554243  0.853573  -1.022793
D  1.576498 -0.361041 -0.887087 -0.784113   0.689411
E  1.992746  1.144939  2.166459  0.734311   4.159205

In [18]:
#drop column
# axis specifies the row or column to be used; 1 for column
# inplace being will make the results permanent 
df.drop('newColumn', axis=1, inplace=True)
df

          W         X         Y         Z
A  0.634612 -0.344411  0.231050  2.028470
B  0.862638 -0.848491  1.059671  0.919996
C  0.531450  0.528992 -1.554243  0.853573
D  1.576498 -0.361041 -0.887087 -0.784113
E  1.992746  1.144939  2.166459  0.734311

In [19]:
df.drop('E')

          W         X         Y         Z
A  0.634612 -0.344411  0.231050  2.028470
B  0.862638 -0.848491  1.059671  0.919996
C  0.531450  0.528992 -1.554243  0.853573
D  1.576498 -0.361041 -0.887087 -0.784113

In [20]:
df.shape

(5, 4)

In [21]:
# selecting rows
df.loc['A']

W    0.634612
X   -0.344411
Y    0.231050
Z    2.028470
Name: A, dtype: float64

In [22]:
df.iloc[2]

W    0.531450
X    0.528992
Y   -1.554243
Z    0.853573
Name: C, dtype: float64

In [23]:
df.loc['B', 'Y']

1.0596708028264181

In [24]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  0.634612  0.231050
B  0.862638  1.059671

In [25]:
booldf=df >0

In [28]:
df[booldf]

          W         X         Y         Z
A  0.634612       NaN  0.231050  2.028470
B  0.862638       NaN  1.059671  0.919996
C  0.531450  0.528992       NaN  0.853573
D  1.576498       NaN       NaN       NaN
E  1.992746  1.144939  2.166459  0.734311

In [29]:
df[df>0]

          W         X         Y         Z
A  0.634612       NaN  0.231050  2.028470
B  0.862638       NaN  1.059671  0.919996
C  0.531450  0.528992       NaN  0.853573
D  1.576498       NaN       NaN       NaN
E  1.992746  1.144939  2.166459  0.734311

In [31]:
# get the dataframe whose w column values are grater than 0  
df[df['W']>0]

          W         X         Y         Z
A  0.634612 -0.344411  0.231050  2.028470
B  0.862638 -0.848491  1.059671  0.919996
C  0.531450  0.528992 -1.554243  0.853573
D  1.576498 -0.361041 -0.887087 -0.784113
E  1.992746  1.144939  2.166459  0.734311

In [32]:
#  grab all rows whose z is less than zero
df[df['Z']<0]

          W         X         Y         Z
D  1.576498 -0.361041 -0.887087 -0.784113

In [33]:
# get the rows whose w column is greater than 0 and get the z column
df[df['W']>0]['Z']

A    2.028470
B    0.919996
C    0.853573
D   -0.784113
E    0.734311
Name: Z, dtype: float64

In [34]:
df[df['W']>0][['Z', 'X']]

          Z         X
A  2.028470 -0.344411
B  0.919996 -0.848491
C  0.853573  0.528992
D -0.784113 -0.361041
E  0.734311  1.144939

In [35]:
# Combining conditionals
# AND
df[(df['W']>0)&(df['Y']>0)]

          W         X         Y         Z
A  0.634612 -0.344411  0.231050  2.028470
B  0.862638 -0.848491  1.059671  0.919996
E  1.992746  1.144939  2.166459  0.734311

In [36]:
# OR conditional
df[(df['W']>0)|(df['Y']>0)]

          W         X         Y         Z
A  0.634612 -0.344411  0.231050  2.028470
B  0.862638 -0.848491  1.059671  0.919996
C  0.531450  0.528992 -1.554243  0.853573
D  1.576498 -0.361041 -0.887087 -0.784113
E  1.992746  1.144939  2.166459  0.734311

In [37]:
# reset index
# df.reset_index()

In [38]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [39]:
df['States'] = newind
df

          W         X         Y         Z States
A  0.634612 -0.344411  0.231050  2.028470     CA
B  0.862638 -0.848491  1.059671  0.919996     NY
C  0.531450  0.528992 -1.554243  0.853573     WY
D  1.576498 -0.361041 -0.887087 -0.784113     OR
E  1.992746  1.144939  2.166459  0.734311     CO

In [40]:
# set states as index
df.set_index('States')

               W         X         Y         Z
States
CA      0.634612 -0.344411  0.231050  2.028470
NY      0.862638 -0.848491  1.059671  0.919996
WY      0.531450  0.528992 -1.554243  0.853573
OR      1.576498 -0.361041 -0.887087 -0.784113
CO      1.992746  1.144939  2.166459  0.734311

In [41]:
df

          W         X         Y         Z States
A  0.634612 -0.344411  0.231050  2.028470     CA
B  0.862638 -0.848491  1.059671  0.919996     NY
C  0.531450  0.528992 -1.554243  0.853573     WY
D  1.576498 -0.361041 -0.887087 -0.784113     OR
E  1.992746  1.144939  2.166459  0.734311     CO

In [42]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
# create a tuple and place them in a list
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [56]:
#  Create multiple indices
df = pd.DataFrame(randn(6,2),hier_index, ['A', 'B'])
df

             A         B
G1 1  0.311215  1.304649
   2  0.729810  0.424086
   3  1.189987 -0.625680
G2 1  0.650117 -1.834521
   2 -0.229008  1.081710
   3 -1.022821 -0.890701

In [58]:
# access the variables
#  start from the outside then to the inner
df.loc['G1'].loc[1]

A    0.311215
B    1.304649
Name: 1, dtype: float64

In [59]:
#  create labels for our indices
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    0.311215  1.304649
       2    0.729810  0.424086
       3    1.189987 -0.625680
G2     1    0.650117 -1.834521
       2   -0.229008  1.081710
       3   -1.022821 -0.890701

In [62]:
df.loc['G2'].loc[2]['B']

1.081709883775434

In [64]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.311215  1.304649
G2      0.650117 -1.834521